week_3/quiz_3.tex
% Created 2024-07-07 Sun 23:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Week 3 Quiz}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Week 3 Quiz},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:org1b516ae}

\textbf{Answer:} A decrease in cash\\

Working capital (WC) is the difference between current assets (CA) and current
liabilities (CL). Then what would produce an increase in WC?
\begin{enumerate}
\item There's an increase in current assets, and/or
\item there's a decrease in current liabilities.
\end{enumerate}
Recall that an increase in CA represents a cash drain. The same is true for a
decrease in CL. Therefore, an increase in net working capital means \textbf{a decrease
in cash}.
\section*{Problem 2}
\label{sec:org747124e}

\textbf{Answer:} \$140 million\\

To compute the free cash flow (FCF), we need to take the operating profit, and
then
\begin{itemize}
\item subtract the increase in working capital;
\item add the depreciation back;
\item subtract the capital expenditure; and
\item add the after-tax salvage value.
\end{itemize}
In this problem, we have the following:
\begin{itemize}
\item operating profit: \$100 million;
\item no change in working capital;
\item no depreciation;
\item capital expenditure: \$10 million;
\item salvage value: \$50 million.
\end{itemize}
Then, in units of \$1 million, we can write the FCF as
\begin{equation}
\mathrm{FCF}=100-0+0-10+50=140.
\end{equation}
Therefore, the company's free cash flow for the year is \$140 million.
\section*{Problem 3}
\label{sec:orgbc779f7}

\textbf{Answer:} \$466,666.67\\

We're going to denote the annual depreciation amount by \(d\). By using this
variable, we can express the depreciated value of the investment for every year:
\begin{itemize}
\item Year 0: \(1,400,000\);
\item Year 1: \(1,400,000-d\);
\item Year 2: \(1,400,000-2d\);
\item Year 3: \(1,400,000-3d=0\).
\end{itemize}
To obtain the value of \(d\), we solve the above equation:
\begin{align}
  \begin{split}
    1,400,000-3d&=0\\
    3d&=1,400,000\\
    d&=\frac{1,400,000}{3}\\
    d&\approx 466,666.67
  \end{split}
\end{align}
Therefore, the annual depreciation amount is approximately \$466,666.67.
\section*{Problem 4}
\label{sec:org4db0539}

\textbf{Answer:} \$224,000\\

This subject is not explained in the lectures. But it seems that the right thing
to do is to compute the profit from sales, and then use the tax rate to obtain
the amount to be paid in taxes.
By using the sales values given in the problem statement, it's easy to compute
the profit: \$640,000. It's also simple to check that 35\% of this amount is
\$224,000. This is how much we have to pay in taxes.
\section*{Problem 5}
\label{sec:org133f36c}

\textbf{Answer:} \$163,333.33\\

This subject isn't clearly explained in the lectures either. So I'll just do
what seems to be the most reasonable thing. We already know that the annual
depreciation amount is \$466,666.67. From the previous problem, we also know that
the tax rate is 35\%. Then the tax savings from depreciation must correspond to
35\% of \$466,666.67.
It's easy to check that this amount is approximately \$163,333.33.
\section*{Problem 6}
\label{sec:org79d6aad}

\textbf{Answer:} \$579,333.33\\

Let's begin by summarizing the information we have so far. From the other
problems, we know the following:
\begin{itemize}
\item the revenue is \$1,120,000;
\item the cost is \$480,000;
\item the amount to be paid in taxes is \$224,000;
\item the tax savings from depreciation is \$163,333.33.
\end{itemize}
We can use these values to compute the operating cash flow (OCF) as follows:
\begin{equation}
\mathrm{OCF}=1,120,000-480,000-224,000+163,333.33=579,333.33.
\end{equation}
\section*{Problem 7}
\label{sec:org4eead2f}

\textbf{Answer:} \$100 million\\

In this problem, we shall express amounts in units of \$1 million. Then we have
the following:
\begin{itemize}
\item XYZ has revenues of 500;
\item the cost of goods sold (COGS) is 300;
\item the depreciation amount is 100.
\end{itemize}
As explained in the lectures, the EBIT is computed as follows:
\begin{equation}
\mathrm{EBIT}=\mathrm{Revenues}-\mathrm{COGS}-\mathrm{Depreciation}.
\end{equation}
Hence:
\begin{equation}
\mathrm{EBIT}=500-300-100=100.
\end{equation}
Therefore, the company's EBIT is \$100 million.
\section*{Problem 8}
\label{sec:org9c7c94d}

\textbf{Answer:} \$70 million\\

We already know the value of the EBIT. Then we can use this value, along with
the tax rate, to compute how much the company has to pay in taxes. Since this
rate is \(r=0.3\), the tax amount \(T\) can be determined as follows:
\begin{align}
  \begin{split}
    T&=\mathrm{EBIT}\times r\\
    &=100\times 0.3\\
    &=30.
  \end{split}
\end{align}
This means the company needs to pay \$30 million in taxes. Now, to obtain the
NOPAT, we simply subtract \(T\) from the EBIT. After all, NOPAT represents the
profit generated by the company after accounting for both operating expenses and
taxes. Hence:
\begin{align}
  \begin{split}
    \mathrm{NOPAT}&=\mathrm{EBIT}-T\\
    &=100-30\\
    &=70.
  \end{split}
\end{align}
Therefore, the company's NOPAT is \$70 million.
\section*{Problem 9}
\label{sec:org64fdb0b}

\textbf{Answer:} \$110 million\\

We already know the amount corresponding to the NOPAT. Then, to compute the free
cash flow (FCF), we need to take the NOPAT, and
\begin{itemize}
\item add back the depreciation;
\item subtract the increase in working capital;
\item subtract the capital expenditure.
\end{itemize}
The values for the relevant amounts are
\begin{itemize}
\item NOPAT: 70;
\item Depreciation: 100;
\item Working capital increase: 50;
\item Capital expenditure: 10.
\end{itemize}
Hence:
\begin{equation}
\mathrm{FCF}=70+100-50-10=110.
\end{equation}
Therefore, the company's free cash flow is \$110 million.
\end{document}
